; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v1 ?v12)
             (pred_4 ?v11 ?v6)
             (pred_6 ?v1 ?v6)
             (pred_10 ?v3 ?v1 )
	     (pred_5 ?v1)
             (pred_1 ?v7)
             (pred_7 ?v11)
             (pred_11 ?v6)
             (pred_8 ?v1)
             (pred_9 ?v11)
             (pred_12 ?v1)
             (pred_2 ))



(:action op_1
:parameters (?v13 ?v10 ?v8 ?v4)
:precondition (and (pred_1 ?v13) (pred_1 ?v10) (pred_7 ?v8) (pred_11 ?v4)
          (pred_3 ?v13 ?v10) (pred_4 ?v8 ?v4)
                   (pred_6 ?v10 ?v4) (pred_5 ?v13) 
                   (pred_8 ?v10) (pred_9 ?v8))
:effect (and  (pred_12 ?v10) (not (pred_8 ?v10))))


(:action op_3
:parameters (?v13 ?v9)
:precondition (and (pred_1 ?v13) (pred_1 ?v9)
               (pred_5 ?v13) (pred_3 ?v13 ?v9) (pred_12 ?v9))
:effect (and (pred_5 ?v9) (not (pred_5 ?v13))))

(:action op_4
:parameters (?v13 ?v8)
:precondition (and (pred_1 ?v13) (pred_7 ?v8) 
                  (pred_5 ?v13) (pred_10 ?v8 ?v13) (pred_2 ))
:effect (and (pred_9 ?v8)
   (not (pred_10 ?v8 ?v13)) (not (pred_2 ))))


(:action op_5
:parameters (?v13 ?v5 ?v2)
:precondition (and (pred_1 ?v13) (pred_7 ?v5) (pred_7 ?v2)
                  (pred_5 ?v13) (pred_9 ?v2) (pred_10 ?v5 ?v13))
:effect (and (pred_9 ?v5) (pred_10 ?v2 ?v13)
        (not (pred_9 ?v2)) (not (pred_10 ?v5 ?v13))))

(:action op_2
:parameters (?v13 ?v8)
:precondition (and (pred_1 ?v13) (pred_7 ?v8) 
                  (pred_5 ?v13) (pred_9 ?v8))
:effect (and (pred_2 ) (pred_10 ?v8 ?v13) (not (pred_9 ?v8)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_20 obj_21 obj_11 obj_05 obj_06 obj_07 obj_03 obj_24 obj_17 obj_13 obj_01 obj_29 obj_25 obj_32 obj_26 obj_19 obj_15 obj_23 obj_22 obj_02 obj_18 obj_27 obj_28 obj_31 obj_30
    obj_14 obj_09 obj_12
    obj_08 obj_10 obj_04 obj_16
    )

    (:init
       (pred_2)

       (pred_1 obj_20)
       (pred_1 obj_21)
       (pred_1 obj_11)
       (pred_1 obj_05)
       (pred_1 obj_06)
       (pred_1 obj_07)
       (pred_1 obj_03)
       (pred_1 obj_24)
       (pred_1 obj_17)
       (pred_1 obj_13)
       (pred_1 obj_01)
       (pred_1 obj_29)
       (pred_1 obj_25)
       (pred_1 obj_32)
       (pred_1 obj_26)
       (pred_1 obj_19)
       (pred_1 obj_15)
       (pred_1 obj_23)
       (pred_1 obj_22)
       (pred_1 obj_02)
       (pred_1 obj_18)
       (pred_1 obj_27)
       (pred_1 obj_28)
       (pred_1 obj_31)
       (pred_1 obj_30)
       (pred_11 obj_14)
       (pred_11 obj_09)
       (pred_11 obj_12)
       (pred_7 obj_08)
       (pred_7 obj_10)
       (pred_7 obj_04)
       (pred_7 obj_16)

       (pred_3 obj_20 obj_07)
       (pred_3 obj_20 obj_21)
       (pred_3 obj_21 obj_03)
       (pred_3 obj_21 obj_11)
       (pred_3 obj_21 obj_20)
       (pred_3 obj_11 obj_24)
       (pred_3 obj_11 obj_05)
       (pred_3 obj_11 obj_21)
       (pred_3 obj_05 obj_17)
       (pred_3 obj_05 obj_06)
       (pred_3 obj_05 obj_11)
       (pred_3 obj_06 obj_13)
       (pred_3 obj_06 obj_05)
       (pred_3 obj_07 obj_01)
       (pred_3 obj_07 obj_03)
       (pred_3 obj_07 obj_20)
       (pred_3 obj_03 obj_29)
       (pred_3 obj_03 obj_24)
       (pred_3 obj_03 obj_21)
       (pred_3 obj_03 obj_07)
       (pred_3 obj_24 obj_25)
       (pred_3 obj_24 obj_17)
       (pred_3 obj_24 obj_11)
       (pred_3 obj_24 obj_03)
       (pred_3 obj_17 obj_32)
       (pred_3 obj_17 obj_13)
       (pred_3 obj_17 obj_05)
       (pred_3 obj_17 obj_24)
       (pred_3 obj_13 obj_26)
       (pred_3 obj_13 obj_06)
       (pred_3 obj_13 obj_17)
       (pred_3 obj_01 obj_19)
       (pred_3 obj_01 obj_29)
       (pred_3 obj_01 obj_07)
       (pred_3 obj_29 obj_15)
       (pred_3 obj_29 obj_25)
       (pred_3 obj_29 obj_03)
       (pred_3 obj_29 obj_01)
       (pred_3 obj_25 obj_23)
       (pred_3 obj_25 obj_32)
       (pred_3 obj_25 obj_24)
       (pred_3 obj_25 obj_29)
       (pred_3 obj_32 obj_22)
       (pred_3 obj_32 obj_26)
       (pred_3 obj_32 obj_17)
       (pred_3 obj_32 obj_25)
       (pred_3 obj_26 obj_02)
       (pred_3 obj_26 obj_13)
       (pred_3 obj_26 obj_32)
       (pred_3 obj_19 obj_18)
       (pred_3 obj_19 obj_15)
       (pred_3 obj_19 obj_01)
       (pred_3 obj_15 obj_27)
       (pred_3 obj_15 obj_23)
       (pred_3 obj_15 obj_29)
       (pred_3 obj_15 obj_19)
       (pred_3 obj_23 obj_28)
       (pred_3 obj_23 obj_22)
       (pred_3 obj_23 obj_25)
       (pred_3 obj_23 obj_15)
       (pred_3 obj_22 obj_31)
       (pred_3 obj_22 obj_02)
       (pred_3 obj_22 obj_32)
       (pred_3 obj_22 obj_23)
       (pred_3 obj_02 obj_30)
       (pred_3 obj_02 obj_26)
       (pred_3 obj_02 obj_22)
       (pred_3 obj_18 obj_27)
       (pred_3 obj_18 obj_19)
       (pred_3 obj_27 obj_28)
       (pred_3 obj_27 obj_15)
       (pred_3 obj_27 obj_18)
       (pred_3 obj_28 obj_31)
       (pred_3 obj_28 obj_23)
       (pred_3 obj_28 obj_27)
       (pred_3 obj_31 obj_30)
       (pred_3 obj_31 obj_22)
       (pred_3 obj_31 obj_28)
       (pred_3 obj_30 obj_02)
       (pred_3 obj_30 obj_31)
       (pred_8 obj_03)
       (pred_8 obj_22)
       (pred_8 obj_21)
       (pred_8 obj_28)
       (pred_6  obj_03 obj_14)
       (pred_6  obj_22 obj_09)
       (pred_6  obj_21 obj_12)
       (pred_6  obj_28 obj_12)
       (pred_12 obj_20)
       (pred_12 obj_11)
       (pred_12 obj_05)
       (pred_12 obj_06)
       (pred_12 obj_07)
       (pred_12 obj_24)
       (pred_12 obj_17)
       (pred_12 obj_13)
       (pred_12 obj_01)
       (pred_12 obj_29)
       (pred_12 obj_25)
       (pred_12 obj_32)
       (pred_12 obj_26)
       (pred_12 obj_19)
       (pred_12 obj_15)
       (pred_12 obj_23)
       (pred_12 obj_02)
       (pred_12 obj_18)
       (pred_12 obj_27)
       (pred_12 obj_31)
       (pred_12 obj_30)

       (pred_4  obj_08 obj_14)
       (pred_4  obj_10 obj_09)
       (pred_4  obj_04 obj_12)
       (pred_4  obj_16 obj_09)
       (pred_10 obj_08 obj_31)
       (pred_10 obj_10 obj_24)
       (pred_10 obj_04 obj_27)
       (pred_10 obj_16 obj_01)
       (pred_5 obj_29)
    )

    (:goal (and
       (pred_10 obj_08 obj_30)
       (pred_10 obj_10 obj_31)
       (pred_10 obj_04 obj_02)
       (pred_10 obj_16 obj_20)
    ))
(:constraints
  (always (not (pred_5 obj_28)))
)
)

; plan
1. (op_3 obj_29 obj_01)
   deleted: (pred_5 obj_29)
   added: (pred_5 obj_01)
   goals met: 0 of 4
2. (op_4 obj_01 obj_16)
   deleted: (pred_10 obj_16 obj_01) (pred_2)
   added: (pred_9 obj_16)
   goals met: 0 of 4
3. (op_3 obj_01 obj_07)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_07)
   goals met: 0 of 4
4. (op_3 obj_07 obj_20)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_20)
   goals met: 0 of 4
5. (op_2 obj_20 obj_16)
   deleted: (pred_9 obj_16)
   added: (pred_2) (pred_10 obj_16 obj_20)
   goals met: 1 of 4
6. (op_3 obj_20 obj_07)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_07)
   goals met: 1 of 4
7. (op_3 obj_07 obj_01)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_01)
   goals met: 1 of 4
8. (op_3 obj_01 obj_29)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_29)
   goals met: 1 of 4
9. (op_3 obj_29 obj_15)
   deleted: (pred_5 obj_29)
   added: (pred_5 obj_15)
   goals met: 1 of 4
10. (op_3 obj_15 obj_27)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_27)
   goals met: 1 of 4
11. (op_4 obj_27 obj_04)
   deleted: (pred_10 obj_04 obj_27) (pred_2)
   added: (pred_9 obj_04)
   goals met: 1 of 4
12. (op_1 obj_27 obj_28 obj_04 obj_12)
   deleted: (pred_8 obj_28)
   added: (pred_12 obj_28)
   goals met: 1 of 4
13. (op_3 obj_27 obj_15)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_15)
   goals met: 1 of 4
14. (op_3 obj_15 obj_23)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_23)
   goals met: 1 of 4
15. (op_3 obj_23 obj_25)
   deleted: (pred_5 obj_23)
   added: (pred_5 obj_25)
   goals met: 1 of 4
16. (op_3 obj_25 obj_24)
   deleted: (pred_5 obj_25)
   added: (pred_5 obj_24)
   goals met: 1 of 4
17. (op_5 obj_24 obj_10 obj_04)
   deleted: (pred_9 obj_04) (pred_10 obj_10 obj_24)
   added: (pred_9 obj_10) (pred_10 obj_04 obj_24)
   goals met: 1 of 4
18. (op_3 obj_24 obj_25)
   deleted: (pred_5 obj_24)
   added: (pred_5 obj_25)
   goals met: 1 of 4
19. (op_3 obj_25 obj_23)
   deleted: (pred_5 obj_25)
   added: (pred_5 obj_23)
   goals met: 1 of 4
20. (op_1 obj_23 obj_22 obj_10 obj_09)
   deleted: (pred_8 obj_22)
   added: (pred_12 obj_22)
   goals met: 1 of 4
21. (op_3 obj_23 obj_22)
   deleted: (pred_5 obj_23)
   added: (pred_5 obj_22)
   goals met: 1 of 4
22. (op_3 obj_22 obj_31)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_31)
   goals met: 1 of 4
23. (op_5 obj_31 obj_08 obj_10)
   deleted: (pred_9 obj_10) (pred_10 obj_08 obj_31)
   added: (pred_9 obj_08) (pred_10 obj_10 obj_31)
   goals met: 2 of 4
24. (op_3 obj_31 obj_30)
   deleted: (pred_5 obj_31)
   added: (pred_5 obj_30)
   goals met: 2 of 4
25. (op_2 obj_30 obj_08)
   deleted: (pred_9 obj_08)
   added: (pred_2) (pred_10 obj_08 obj_30)
   goals met: 3 of 4
26. (op_3 obj_30 obj_02)
   deleted: (pred_5 obj_30)
   added: (pred_5 obj_02)
   goals met: 3 of 4
27. (op_3 obj_02 obj_26)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_26)
   goals met: 3 of 4
28. (op_3 obj_26 obj_13)
   deleted: (pred_5 obj_26)
   added: (pred_5 obj_13)
   goals met: 3 of 4
29. (op_3 obj_13 obj_17)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_17)
   goals met: 3 of 4
30. (op_3 obj_17 obj_24)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_24)
   goals met: 3 of 4
31. (op_4 obj_24 obj_04)
   deleted: (pred_10 obj_04 obj_24) (pred_2)
   added: (pred_9 obj_04)
   goals met: 3 of 4
32. (op_3 obj_24 obj_17)
   deleted: (pred_5 obj_24)
   added: (pred_5 obj_17)
   goals met: 3 of 4
33. (op_3 obj_17 obj_13)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_13)
   goals met: 3 of 4
34. (op_3 obj_13 obj_26)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_26)
   goals met: 3 of 4
35. (op_3 obj_26 obj_02)
   deleted: (pred_5 obj_26)
   added: (pred_5 obj_02)
   goals met: 3 of 4
36. (op_2 obj_02 obj_04)
   deleted: (pred_9 obj_04)
   added: (pred_2) (pred_10 obj_04 obj_02)
   goals met: 4 of 4
